<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest IntelliJ Community Edition and creates a signed package. The installer package includes a preinstall script that will check for an existing IntelliJ IDEA CE.app in /Applications and remove it if found.</string>
	<key>Identifier</key>
	<string>com.github.howthegodschill.pkg.IntellijIDEACESigned</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>IntelliJ IDEA CE</string>
		<key>SIGNINGCERTIFICATE</key>
		<string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.howthegodschill.download.IntellijIDEACESigned</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/IntelliJ IDEA CE.app</string>
				<key>source_path</key>
				<string>%pathname%/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>com.jetbrains.intellij.ce</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
    <dict>
      <key>Processor</key>
      <string>PkgSigner</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        <key>signing_cert</key>
        <string>%SIGNINGCERTIFICATE%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PathDeleter</string>
      <key>Arguments</key>
      <dict>
        <key>path_list</key>
        <array>
          <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%-unsigned.pkg</string>
        </array>
      </dict>
    </dict>
	</array>
</dict>
</plist>
