<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Adobe Reader DC and extracts the installer package.</string>
	<key>Identifier</key>
	<string>com.github.howthegodschill.pkg.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>SIGNINGCERTIFICATE</key>
		<string>Put_Signing_Certificate_into_AutoPkg_recipe_override</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.howthegodschill.download.AdobeReaderDC</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/application.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/version_check</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/version_check/Adobe Acrobat Reader DC.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
				<dict>
					<key>Processor</key>
					<string>PkgSigner</string>
					<key>Arguments</key>
					<dict>
						<key>pkg_path</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
						<key>signing_cert</key>
						<string>%SIGNINGCERTIFICATE%</string>
					</dict>
				</dict>
        <dict>
						<key>Processor</key>
	        	<string>PathDeleter</string>
						<key>Arguments</key>
						<dict>
            	<key>path_list</key>
            		<array>
									<string>%RECIPE_CACHE_DIR%/%NAME%-%version%-unsigned.pkg</string>
                	<string>%RECIPE_CACHE_DIR%/unpack</string>
                	<string>%RECIPE_CACHE_DIR%/version_check</string>
            		</array>
        		</dict>
        </dict>
	</array>
</dict>
</plist>
