<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Thunderbird package.
Some useful values for RELEASE are: 'latest', 'beta-latest'.
LOCALE controls the language localization to be downloaded.
Examples include 'en-US', 'de', 'sv-SE', and 'zh-TW'
See the following URLs for more info:
    http://ftp.mozilla.org/pub/thunderbird/releases/latest/README.txt
    http://ftp.mozilla.org/pub/thunderbird/releases/latest-beta/README.txt</string>
	<key>Identifier</key>
	<string>com.github.howthegodschill.download.ThunderbirdSignedPkg</string>
	<key>Input</key>
	<dict>
		<key>LATEST_RELEASE</key>
		<string>LATEST_THUNDERBIRD_VERSION</string>
		<key>LOCALE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>Thunderbird</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"%LATEST_RELEASE%": "([\d\.abesr]+)"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://product-details.mozilla.org/1.0/thunderbird_versions.json</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.pkg</string>
				<key>url</key>
				<string>https://releases.mozilla.org/pub/thunderbird/releases/%version%/mac/%LOCALE%/Thunderbird%20%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Mozilla Corporation (43AQ936H96)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
