---
Description: Downloads the latest version of Slack creates a package.
Identifier: com.github.howthegodschill.pkg.Slack
ParentRecipe: com.github.howthegodschill.download.Slack
MinimumVersion: '2.3'

Input:
  NAME: Slack
  PKG_ID: com.tinyspeck.slackmacgap

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      source_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Slack.app'
      destination_path: '%pkgroot%/Applications/Slack.app'

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'