Identifier: com.github.howthegodschill.jamf.Slack-pkg-upload
ParentRecipe: com.github.killahquam.pkg.slack
MinimumVersion: '2.3'

Input:
  NAME: Slack
  CATEGORY: Communication

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
