Identifier: com.github.howthegodschill.jamf.zoom.us-pkg-upload
ParentRecipe: com.github.smithjw.pkg.zoom_it
MinimumVersion: '2.3'

Input:
  NAME: zoom.us
  CATEGORY: Communication

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'
    jcds_mode: True

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
    jcds_mode: True
