Identifier: com.github.howthegodschill.jamf.Notion-intel-upload
ParentRecipe: com.github.howthegodschill.intel.pkg.Notion
MinimumVersion: '2.3'

Input:
  NAME: Notion (Intel)
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
