---
Description: Downloads the latest version of Notion for Intel and creates a package.
Identifier: com.github.howthegodschill.intel.pkg.Notion
ParentRecipe: com.github.howthegodschill.intel.download.Notion
MinimumVersion: '2.3'

Input:
  NAME: Notion

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/payload'

  - Processor: Copier
    Arguments:
      source_path: '%pathname%/Notion.app'
      destination_path: '%pkgroot%/Applications/Notion.app'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: '%bundleid%'
        options: purge_ds_store
        pkgdir: '%RECIPE_CACHE_DIR%'
        pkgname: '%NAME%-%ARCHITECTURE%-%version%'

  - Processor: com.github.smithjw.processors/FriendlyPathDeleter
    Arguments:
      fail_deleter_silently: true
      path_list:
        - '%RECIPE_CACHE_DIR%/payload'
