Identifier: com.github.howthegodschill.jamf.Notion-upload
ParentRecipe: com.github.howthegodschill.pkg.Notion
MinimumVersion: '2.3'

Input:
  NAME: Notion
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
