Identifier: com.github.howthegodschill.jamf.Microsoft_OneNote-upload
ParentRecipe: com.github.rtrouton.pkg.microsoftonenote365
MinimumVersion: '2.3'

Input:
  NAME: Microsoft OneNote
  CATEGORY: Microsoft Office Suite

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
