Identifier: com.github.howthegodschill.jamf.Microsoft_Excel-upload
ParentRecipe: com.github.rtrouton.pkg.microsoftexcel365
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Excel
  CATEGORY: Microsoft Office Suite

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
