Identifier: com.github.howthegodschill.jamf.Microsoft_Word-upload
ParentRecipe: om.github.rtrouton.pkg.microsoftword365
MinimumVersion: '2.3'

Input:
  NAME: Microsoft Word
  CATEGORY: Microsoft Office Suite

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
