Identifier: com.github.howthegodschill.jamf.Microsoft_PowerPoint-upload
ParentRecipe: com.github.rtrouton.pkg.microsoftpowerpoint365
MinimumVersion: '2.3'

Input:
  NAME: Microsoft PowerPoint
  CATEGORY: Microsoft Office Suite

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
