<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest LastPass for Safari</string>
	<key>Identifier</key>
	<string>com.github.howthegodschill.download.LastPass</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
        <string>LastPass_Safari</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
			    <key>url</key>
			    <string>https://download.cloud.lastpass.com/mac/LastPass.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>strict_verification</key>
				<true/>
				<key>input_path</key>
				<string>%pathname%/LastPass.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.lastpass.lastpassmacdesktop" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N24REP3BMN)</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>
