Comment: Recipe automatically generated from com.github.jss-recipes.jss.iTerm2 by JamfRecipeMaker
Identifier: com.github.howthegodschill.jamf.iTerm2-upload
ParentRecipe: io.github.hjuutilainen.pkg.iTerm2
MinimumVersion: '2.3'

Input:
  NAME: iTerm2
  CATEGORY: Development

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'
    jcds_mode: True

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
    jcds_mode: True
