Identifier: com.github.howthegodschill.jamf.LastPass-upload
ParentRecipe: com.github.poundbangbash.eholtam-recipes.pkg.LastPass_Safari
MinimumVersion: '2.3'

Input:
  NAME: LastPass
  CATEGORY: Security

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'
    jcds_mode: True

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
    jcds_mode: True
