<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Sqlectron DMG from GitHub</string>
	<key>Identifier</key>
	<string>com.github.howthegodschill.download.Sqlectron</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Sqlectron</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>(sqlectron-[0-9]+.[0-9]+.[0-9]+.dmg)</string>
				<key>github_repo</key>
				<string>sqlectron/sqlectron-gui</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
