<?xml version="1.0" encoding="UTF-8"?>
  <policy>
    <general>
      <name>%SELF_SERVICE_POLICY_NAME%</name>
      <enabled>true</enabled>
      <frequency>%SELF_SERVICE_POLICY_FREQUENCY%</frequency>
      <category>
        <name>%SELF_SERVICE_POLICY_CATEGORY%</name>
      </category>
    </general>
    <scope>
      <all_computers>true</all_computers>
      <exclusions>
        <computers/>
        <computer_groups>
           <computer_group>
              <name>%SELF_SERVICE_GROUP_EXCLUSION_1%</name>
           </computer_group>
           </computer_groups>
       </exclusions>
    </scope>
    <self_service>
      <use_for_self_service>true</use_for_self_service>
      <self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
      <install_button_text>Install</install_button_text>
      <reinstall_button_text>Reinstall</reinstall_button_text>
      <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
      <force_users_to_view_description>true</force_users_to_view_description>
      <feature_on_main_page>false</feature_on_main_page>
      <self_service_categories>
        <category>
          <name>%SELF_SERVICE_POLICY_CATEGORY%</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories>
    </self_service>
    <maintenance>
       <recon>%SELF_SERVICE_POLICY_RECON%</recon>
    </maintenance>
    <files_processes>
      <run_command>%SELF_SERVICE_POLICY_COMMAND_TRIGGER%</run_command>
    </files_processes>
  </policy>