Identifier: com.github.howthegodschill.jamf.Chrome-upload
ParentRecipe: com.github.autopkg.pkg.googlechrome
MinimumVersion: '2.3'

Input:
  NAME: Google Chrome
  CATEGORY: Browsers

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
