Identifier: com.github.howthegodschill.jamf.Firefox-pkg-upload
ParentRecipe: com.github.rtrouton.pkg.Firefox
MinimumVersion: '2.3'

Input:
  NAME: Firefox
  CATEGORY: Browsers

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
