Identifier: com.github.howthegodschill.jamf.Firefox-pkg-upload
ParentRecipe: com.github.rtrouton.pkg.Firefox
MinimumVersion: '2.3'

Input:
  NAME: Firefox
  CATEGORY: Browsers

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'
    jcds_mode: True

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
    jcds_mode: True
