Identifier: com.github.howthegodschill.jamf.FileZilla-upload
ParentRecipe: com.github.scriptingosx.pkg.FileZilla
MinimumVersion: '2.3'

Input:
  NAME: FileZilla
  CATEGORY: Productivity

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
