Identifier: com.github.howthegodschill.jamf.Communicator-upload
ParentRecipe: com.github.howthegodschill.pkg.Communicator
MinimumVersion: '2.3'

Input:
  NAME: Clearspan Communicator
  CATEGORY: Communication

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
