Description: Downloads the latest version of 1Password.
Identifier: com.github.howthegodschill.download.1password
MinimumVersion: '2.3'

Input:
  NAME: 1Password
  DOWNLOAD_URL: https://downloads.1password.com/mac/1Password.zip

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    download_dir: '%RECIPE_CACHE_DIR%/downloads'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.zip'
    destination_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%/1Password Installer.app'
    expected_authority_names:
    - 'Developer ID Installer: Zoom Video Communications, Inc. (BJ4HAAB9B3)'
    - 'Developer ID Installer: AgileBits Inc. (2BUA8C4S2C)'
    - Developer ID Certification Authority
    - Apple Root CA
    deep_verification: true
    strict_verification: true

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%/1Password Installer.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
