Identifier: com.github.howthegodschill.jamf.1Password-upload
ParentRecipe: io.github.hjuutilainen.pkg.1Password8
MinimumVersion: '2.3'

Input:
  NAME: 1Password
  CATEGORY: Security

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
    jcds2_mode: True