<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version PyCharm.</string>
    <key>Identifier</key>
    <string>com.github.howthegodschill.download.pycharm-applesilicon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyCharm CE AS</string>
        <key>SEARCH_URL</key>
        <string>https://data.services.jetbrains.com/products/releases?code=PCC</string>
        <key>SEARCH_PATTERN</key>
        <string>macM1":{"link":"([^,]*?20\d{2,2}(.\d{1,4}){1,3}-aarch64.dmg)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/PyCharm CE AS.app</string>
                <key>requirement</key>
                <string>identifier "com.jetbrains.pycharm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
