Identifier: com.github.howthegodschill.jamf.Vivaldi-upload
ParentRecipe: com.github.homebysix.pkg.Vivaldi
MinimumVersion: '2.3'

Input:
  NAME: Vivaldi
  CATEGORY: Browsers

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'
